---
kind: property
id: P:Autodesk.Revit.DB.ColorOptions.EditingColor
source: html/9540f352-d5e3-d1a2-2e81-a0a578fd83b7.htm
---
# Autodesk.Revit.DB.ColorOptions.EditingColor Property

The color of the current canvas theme used to render elements when editing.

## Syntax (C#)
```csharp
public Color EditingColor { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null